In [1]:
import numpy as np
a = np.array([[1, 6],
            [2, 8],
            [3, 11],
            [3, 10],
            [1, 7]])
mean_a = np.mean(a, axis = 0)
print(mean_a)

[2.  8.4]

In [2]:
a_centered = np.subtract(a, mean_a)
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

In [3]:
a_centered_sp = a_centered[:,0] @ a_centered[:,1]
print(a_centered_sp)
num_rows = a.shape[0]
covar = a_centered_sp / (a.shape[0] - 1)
print(covar)

8.0
2.0

In [4]:
covar = np.cov(np.transpose(a))
print(covar)

[[1.  2. ]
 [2.  4.3]]

In [40]:
import pandas as pd
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name': ['Тургенев', 'Чехов', 'Островский'],
})

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [41]:
books = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290],
})

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [44]:
authors_price = pd.merge(authors, books, on='author_id', how='outer')

authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [45]:
authors_price.nlargest(5, "price")

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [53]:
df_1 = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price': 'min_price'})
df_2 = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price': 'max_price'})
df_3 = authors_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price': 'mean_price'})
autor_stat = pd.concat([df_1, df_2, df_3], axis = 1)
autor_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000